public_html/Books Review/Debugging/Debugging Overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Debugging Overview</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Debugging Overview"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-30 21:33:27 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Debugging Overview</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Chapter 2: The Rules−Suitable for Framing</a></li>
<li><a href="#sec-2">Chapter 3: Understand the System</a></li>
<li><a href="#sec-3">Chapter 4: Make it Fail</a></li>
<li><a href="#sec-4">Chapter 8: Keep an Audit Trail</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Chapter 2: The Rules−Suitable for Framing</h2>
<div class="outline-text-2" id="text-1">

<p>DEBUGGING RULES
</p>
<p class="verse">
UNDERSTAND THE SYSTEM<br/>
MAKE IT FAIL<br/>
QUIT THINKING AND LOOK<br/>
DIVIDE AND CONQUER<br/>
CHANGE ONE THING AT A TIME<br/>
KEEP AN AUDIT TRAIL<br/>
CHECK THE P LUG<br/>
GET A FRESH VIEW<br/>
IF YOU DIDN'T FIX IT, IT AIN'T FIXED<br/>
</p>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Chapter 3: Understand the System</h2>
<div class="outline-text-2" id="text-2">

<p>This is the first rule because it's the most important. Understand?
</p>
<ul>
<li>Read the manual. It'll tell you to lubricate the trimmer head on your weed whacker so that
  the lines don't fuse together.

</li>
<li>Read everything in depth. The section about the interrupt getting to your microcomputer is
  buried on page 37.

</li>
<li>Know the fundamentals. Chain saws are supposed to be loud.

</li>
<li>Know the road map. Engine speed can be different from tire speed, and the difference is in
  the transmission.

</li>
<li>Understand your tools. Know which end of the thermometer is which, and how to use the
  fancy features on your Glitch−O−Matic logic analyzer.

</li>
<li>Look up the details. Even Einstein looked up the details. Kneejerk, on the other hand,
  trusted his memory.
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Chapter 4: Make it Fail</h2>
<div class="outline-text-2" id="text-3">


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Chapter 8: Keep an Audit Trail</h2>
<div class="outline-text-2" id="text-4">

<p>Better yet, don't remember "Keep an Audit Trail." Write down "Keep an
Audit Trail."
</p>
<ul>
<li>Write down what you did, in what order, and what happened as a result. When did you
  last drink coffee? When did the headache start?

</li>
<li>Understand that any detail could be the important one. It had to be a plaid shirt to crash
  the video chip.

</li>
<li>Correlate events. "It made a noise for four seconds starting at 21:04:53" is better than "It
  made a noise."

</li>
<li>Understand that audit trails for design are also good for testing. Software configuration
  control tools can tell you which revision introduced the bug.

</li>
<li>Write it down! No matter how horrible the moment, make a memorandum of it.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-30 21:33:27 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
